espressif/esp-idf/components/esp_hal_gpspi/esp32s2/include/hal/spi_ll.h
typedef union {
    struct {
        uint32_t bitmap: 28;
        uint32_t magic_value: 4;
    };
    uint32_t val;
} spi_ll_sct_bitmap_reg_t;

typedef struct spi_ll_sct_full_reg_t {
    volatile spi_ll_sct_bitmap_reg_t bitmap;
    // volatile spi_cmd_reg_t cmd;  // don't use cmd reg to align to other targets
    volatile spi_addr_reg_t addr;
    volatile spi_ctrl_reg_t ctrl;
    volatile spi_ctrl1_reg_t ctrl1;
    volatile spi_ctrl2_reg_t ctrl2;
    volatile spi_clock_reg_t clock;
    volatile spi_user_reg_t user;
    volatile spi_user1_reg_t user1;
    volatile spi_user2_reg_t user2;
    volatile spi_mosi_dlen_reg_t mosi_dlen;
    volatile spi_miso_dlen_reg_t miso_dlen;
    volatile spi_misc_reg_t misc;
    volatile spi_slave_reg_t slave;
    volatile spi_fsm_reg_t fsm;
    volatile spi_hold_reg_t hold;
    volatile spi_dma_int_ena_reg_t dma_int_ena;
    volatile spi_dma_int_raw_reg_t dma_int_raw;
    volatile spi_dma_int_clr_reg_t dma_int_clr;
    /** Below registers are hardware supported but not used in spi sct mode
     *  keep here for reference
     */
    // volatile spi_din_mode_reg_t din_mode;
    // volatile spi_din_num_reg_t din_num;
    // volatile spi_dout_mode_reg_t dout_mode;
    // volatile spi_dout_num_reg_t dout_num;
    // volatile spi_lcd_ctrl_reg_t lcd_ctrl;
    // volatile spi_lcd_ctrl1_reg_t lcd_ctrl1;
    // volatile spi_lcd_ctrl2_reg_t lcd_ctrl2;
    // volatile spi_lcd_d_mode_reg_t lcd_d_mode;
    // volatile spi_lcd_d_num_reg_t lcd_d_num;
} spi_ll_sct_full_reg_t;

/**
 * Enable/Disable the conf phase
 *
 * @param hw Beginning address of the peripheral registers.
 * @param enable True: enable; False: disable
 */
static inline void spi_ll_enable_conf_phase(spi_dev_t *hw, bool enable)
{
    hw->slv_rd_byte.usr_conf = enable;
}

/**
 * Set conf phase base bits len to HW for segment config trans mode.
 * need let transaction gap more than approx 2 us under different freq, calculated by driver layer.
 *
 * @param hw Beginning address of the peripheral registers.
 * @param conf_base Conf base bits len.
 */
static inline void spi_ll_set_conf_base_bitslen(spi_dev_t *hw, uint8_t conf_base)
{
    // 7 bits wide
    if (conf_base < 128) {
        hw->slv_wrbuf_dlen.conf_base_bitlen = conf_base;
    }
}

/**
 * Set conf phase bits len to HW for segment config trans mode.
 *
 * @param hw Beginning address of the peripheral registers.
 * @param conf_bitlen Value of field conf_bitslen in cmd reg.
 */
static inline void spi_ll_set_conf_phase_bitlen(spi_dev_t *hw, uint32_t conf_bitlen)
{
    if (conf_bitlen <= SPI_LL_MAX_SCT_CONF_LEN) {
        hw->cmd.conf_bitlen = conf_bitlen;
    }
}

/**
 * Set Segmented-Configure-Transfer required magic value
 *
 * @param hw Beginning address of the peripheral registers.
 * @param magic_value magic value
 */
static inline void spi_ll_set_magic_number(spi_dev_t *hw, uint8_t magic_value)
{
    hw->slv_rd_byte.dma_seg_magic_value = magic_value;
}

/**
 * Initialize the conf buffer:
 *
 * - init bitmap
 * - save all register values into the rest of the conf buffer words
 *
 * @param hw Beginning address of the peripheral registers.
 * @param sct_cfg Beginning address of the SCT conf buffer.
 */
__attribute__((always_inline))
static inline void spi_sct_ll_init_conf_buffer(spi_dev_t *hw, spi_ll_sct_full_reg_t *sct_cfg)
{
    sct_cfg->bitmap.bitmap = 0x3FFFE;
    sct_cfg->bitmap.magic_value = SPI_LL_SCT_MAGIC_NUMBER;
    sct_cfg->addr.val = hw->addr.val;
    sct_cfg->ctrl.val = hw->ctrl.val;
    sct_cfg->ctrl1.val = hw->ctrl1.val;
    sct_cfg->ctrl2.val = hw->ctrl2.val;
    sct_cfg->clock.val = hw->clock.val;
    sct_cfg->user.val = hw->user.val;
    sct_cfg->user1.val = hw->user1.val;
    sct_cfg->user2.val = hw->user2.val;
    sct_cfg->mosi_dlen.val = hw->mosi_dlen.val;
    sct_cfg->miso_dlen.val = hw->miso_dlen.val;
    sct_cfg->misc.val = hw->misc.val;
    sct_cfg->slave.val = hw->slave.val;
    sct_cfg->fsm.val = hw->fsm.val;
    sct_cfg->hold.val = hw->hold.val;
    sct_cfg->dma_int_ena.val = hw->dma_int_ena.val;
    sct_cfg->dma_int_raw.val = hw->dma_int_raw.val;
    sct_cfg->dma_int_clr.val = hw->dma_int_clr.val;
}

/**
 * Update the conf buffer for conf phase
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param is_end Is this transaction the end of this segment.
 */
static inline void spi_sct_ll_mark_sct_end(spi_ll_sct_full_reg_t *sct_cfg, bool is_end)
{
    sct_cfg->user.usr_conf_nxt = !is_end;
}

/**
 * Set SPI to work in full duplex or half duplex mode.
 *
 * @param sct_cfg      Beginning address of the SCT conf buffer.
 * @param half_duplex True to work in half duplex mode, otherwise in full duplex mode.
 */
static inline void spi_sct_ll_set_duplex(spi_ll_sct_full_reg_t *sct_cfg, bool half_duplex)
{
    sct_cfg->user.doutdin = !half_duplex;
}

/**
 * Set CS setup time for a transaction in SCT
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param setup CS setup time
 */
static inline void spi_sct_ll_set_cs_setup(spi_ll_sct_full_reg_t *sct_cfg, uint8_t setup)
{
    sct_cfg->user.cs_setup = !!setup;
    sct_cfg->ctrl2.cs_setup_time = setup - 1;
}

/**
 * Set CS keep active for a transaction in SCT
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param cs_active True to keep CS active, otherwise to release CS.
 */
static inline void spi_sct_ll_set_cs_keep(spi_ll_sct_full_reg_t *sct_cfg, bool cs_active)
{
    sct_cfg->misc.cs_keep_active = cs_active;
}

/**
 * Set CS hold time post trans for a transaction in SCT
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param hold CS hold time
 */
static inline void spi_sct_ll_set_cs_hold(spi_ll_sct_full_reg_t *sct_cfg, int hold)
{
    sct_cfg->user.cs_hold = !!hold;
    sct_cfg->ctrl2.cs_hold_time = hold;
}

/**
 * Update the line mode of conf buffer for conf phase
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param line_mode line mode struct of each phase.
 */
static inline void spi_sct_ll_set_line_mode(spi_ll_sct_full_reg_t *sct_cfg, spi_line_mode_t line_mode)
{
    sct_cfg->ctrl.val &= ~SPI_LL_ONE_LINE_CTRL_MASK;
    sct_cfg->user.val &= ~SPI_LL_ONE_LINE_USER_MASK;
    sct_cfg->ctrl.fcmd_dual = (line_mode.cmd_lines == 2);
    sct_cfg->ctrl.fcmd_quad = (line_mode.cmd_lines == 4);
    sct_cfg->ctrl.fcmd_oct = (line_mode.cmd_lines == 8);
    sct_cfg->ctrl.faddr_dual = (line_mode.addr_lines == 2);
    sct_cfg->ctrl.faddr_quad = (line_mode.addr_lines == 4);
    sct_cfg->ctrl.faddr_oct = (line_mode.addr_lines == 8);
    sct_cfg->ctrl.fread_dual = (line_mode.data_lines == 2);
    sct_cfg->user.fwrite_dual = (line_mode.data_lines == 2);
    sct_cfg->ctrl.fread_quad = (line_mode.data_lines == 4);
    sct_cfg->user.fwrite_quad = (line_mode.data_lines == 4);
    sct_cfg->ctrl.fread_oct = (line_mode.data_lines == 8);
    sct_cfg->user.fwrite_oct = (line_mode.data_lines == 8);
}

/**
 * Update the conf buffer for cmd phase
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param cmd Command value
 * @param cmdlen Length of the cmd phase
 * @param lsbfirst Whether LSB first
 */
static inline void spi_sct_ll_set_command(spi_ll_sct_full_reg_t *sct_cfg, uint16_t cmd, int cmdlen, bool lsbfirst)
{
    sct_cfg->user.usr_command = !!cmdlen;
    if (cmdlen > 0) {
        sct_cfg->user2.usr_command_bitlen = cmdlen - 1;
        HAL_FORCE_MODIFY_U32_REG_FIELD(sct_cfg->user2, usr_command_value, lsbfirst ? cmd : HAL_SPI_SWAP_DATA_TX(cmd, cmdlen));
    }
}

/**
 * Update the conf buffer for addr phase
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param addr Address to set
 * @param addrlen Length of the address phase
 * @param lsbfirst whether the LSB first feature is enabled.
 */
static inline void spi_sct_ll_set_addr(spi_ll_sct_full_reg_t *sct_cfg, uint64_t addr, int addrlen, bool lsbfirst)
{
    sct_cfg->user.usr_addr = !!addrlen;
    if (addrlen > 0) {
        sct_cfg->user1.usr_addr_bitlen = addrlen - 1;
        sct_cfg->addr.val = lsbfirst ? HAL_SWAP32(addr) : (addr << (32 - addrlen));
    }
}

/**
 * Update the conf buffer for dummy phase
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param dummy_n Dummy cycles used. 0 to disable the dummy phase.
 */
static inline void spi_sct_ll_set_dummy(spi_ll_sct_full_reg_t *sct_cfg, int dummy_n)
{
    sct_cfg->user.usr_dummy = !!dummy_n;
    if (dummy_n > 0) {
        HAL_FORCE_MODIFY_U32_REG_FIELD(sct_cfg->user1, usr_dummy_cyclelen, dummy_n - 1);
    }
}

/**
 * Update the conf buffer for dout phase
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param bitlen output length, in bits.
 */
static inline void spi_sct_ll_set_mosi_bitlen(spi_ll_sct_full_reg_t *sct_cfg, int bitlen)
{
    sct_cfg->user.usr_mosi = !!bitlen;
    sct_cfg->mosi_dlen.usr_mosi_dbitlen = bitlen - 1;
}

/**
 * Update the conf buffer for din phase
 *
 * @param sct_cfg Beginning address of the SCT conf buffer.
 * @param bitlen input length, in bits.
 */
static inline void spi_sct_ll_set_miso_bitlen(spi_ll_sct_full_reg_t *sct_cfg, int bitlen)
{
    sct_cfg->user.usr_miso = !!bitlen;
    sct_cfg->miso_dlen.usr_miso_dbitlen = bitlen - 1;
}

#undef SPI_LL_UNUSED_INT_MASK

/**
 * Get the base spi command in esp32s2
 *
 * @param cmd_t           Command value
 */
static inline uint8_t spi_ll_get_slave_hd_base_command(spi_command_t cmd_t)
{
    uint8_t cmd_base = 0x00;
    switch (cmd_t) {
    case SPI_CMD_HD_WRBUF:
        cmd_base = SPI_LL_BASE_CMD_HD_WRBUF;
        break;
    case SPI_CMD_HD_RDBUF:
        cmd_base = SPI_LL_BASE_CMD_HD_RDBUF;
        break;
    case SPI_CMD_HD_WRDMA:
        cmd_base = SPI_LL_BASE_CMD_HD_WRDMA;
        break;
    case SPI_CMD_HD_RDDMA:
        cmd_base = SPI_LL_BASE_CMD_HD_RDDMA;
        break;
    case SPI_CMD_HD_SEG_END:
        cmd_base = SPI_LL_BASE_CMD_HD_SEG_END;
        break;
    case SPI_CMD_HD_EN_QPI:
        cmd_base = SPI_LL_BASE_CMD_HD_EN_QPI;
        break;
    case SPI_CMD_HD_WR_END:
        cmd_base = SPI_LL_BASE_CMD_HD_WR_END;
        break;
    case SPI_CMD_HD_INT0:
        cmd_base = SPI_LL_BASE_CMD_HD_INT0;
        break;
    case SPI_CMD_HD_INT1:
        cmd_base = SPI_LL_BASE_CMD_HD_INT1;
        break;
    case SPI_CMD_HD_INT2:
        cmd_base = SPI_LL_BASE_CMD_HD_INT2;
        break;
    default:
        HAL_ASSERT(cmd_base);
    }
    return cmd_base;
}

/**
 * Get the spi communication command
 *
 * @param cmd_t           Base command value
 * @param line_mode       Line mode of SPI transaction phases: CMD, ADDR, DOUT/DIN.
 */
static inline uint16_t spi_ll_get_slave_hd_command(spi_command_t cmd_t, spi_line_mode_t line_mode)
{
    uint8_t cmd_base = spi_ll_get_slave_hd_base_command(cmd_t);
    uint8_t cmd_mod = 0x00; //CMD:1-bit, ADDR:1-bit, DATA:1-bit

    if (line_mode.data_lines == 2) {
        if (line_mode.addr_lines == 2) {
            cmd_mod = 0x50; //CMD:1-bit, ADDR:2-bit, DATA:2-bit
        } else {
            cmd_mod = 0x10; //CMD:1-bit, ADDR:1-bit, DATA:2-bit
        }
    } else if (line_mode.data_lines == 4) {
        if (line_mode.addr_lines == 4) {
            cmd_mod = 0xA0; //CMD:1-bit, ADDR:4-bit, DATA:4-bit
        } else {
            cmd_mod = 0x20; //CMD:1-bit, ADDR:1-bit, DATA:4-bit
        }
    }
    if (cmd_base == SPI_LL_BASE_CMD_HD_SEG_END || cmd_base == SPI_LL_BASE_CMD_HD_EN_QPI) {
        cmd_mod = 0x00;
    }

    return cmd_base | cmd_mod;
}

/**
 * Get the dummy bits
 *
 * @param line_mode       Line mode of SPI transaction phases: CMD, ADDR, DOUT/DIN.
 */
static inline int spi_ll_get_slave_hd_dummy_bits(spi_line_mode_t line_mode)
{
    uint8_t dummy_bits = 0;

    if (line_mode.data_lines == 2) {
        dummy_bits = 4;
    } else if (line_mode.data_lines == 4) {
        dummy_bits = 4;
    } else {
        dummy_bits = 8;
    }

    HAL_ASSERT(dummy_bits);
    return dummy_bits;
}

#ifdef __cplusplus
}
#endif
